           05  NEW-CODE              PIC X.
           05  NEW-CUSTOMER-ID       PIC X(10).
           05  NEW-EMAIL             PIC X(50).
           05  NEW-LASTNAME          PIC X(30).
           05  NEW-FIRSTNAME         PIC X(20).
           