      *> I treated TRANREC.CPY as FILE record not master transaction record as one doesn't exactly exist.
      *> TechnicALLy, I can GO WITH header parts that all transactions share AND OTHER, and AFTER follow with typed transaction.
      *> However, it feels lile I am just adding extra layer of complexity for no purpose. 
           05  TRAN-LINE             PIC X(300).
